In [11]:
#!pip install pandas

ModuleNotFoundError: No module named 'pandas'

In [13]:
import sys
!{sys.executable} -m pip install pandas
import pandas as pd

Collecting pandas
  Downloading pandas-2.0.3-cp38-cp38-win_amd64.whl (10.8 MB)
Collecting pytz>=2020.1
  Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\pkhad\appdata\local\programs\mu editor\python\lib\site-packages (from pandas) (2.8.2)
Collecting numpy>=1.20.3
  Downloading numpy-1.24.4-cp38-cp38-win_amd64.whl (14.9 MB)
Collecting tzdata>=2022.1
  Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Requirement already satisfied: six>=1.5 in c:\users\pkhad\appdata\local\programs\mu editor\python\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Installing collected packages: tzdata, pytz, numpy, pandas
Successfully installed numpy-1.24.4 pandas-2.0.3 pytz-2025.2 tzdata-2025.2

  WARNING: The script f2py.exe is installed in 'C:\Users\pkhad\AppData\Local\Programs\MUEDIT~1\Python\Scripts' which is not on PATH.
  Consider adding this directory to PATH or, if you prefer to suppress this warning, use --no-warn-script-location.
WARNING: You are using pip version 21.2.4; however, version 25.0.1 is available.
You should consider upgrading via the 'C:\Users\pkhad\AppData\Local\Programs\MUEDIT~1\Python\pythonw.exe -m pip install --upgrade pip' command.

In [14]:
import pandas as pd

In [15]:
titanic_df= pd.read_csv('titanic-data.csv')

## passengers were on board the Titanic?

In [10]:
titanic_df.shape

(891, 12)

In [11]:
len(titanic_df)

891

## average age of passengers who survived vs. who didn’t?

In [12]:
titanic_df.groupby('Survived')['Age'].mean()

Survived
0    30.626179
1    28.343690
Name: Age, dtype: float64

## Create a new column called FamilySize by adding SibSp and Parch + 1 (self).

In [14]:
titanic_df['FamilySize']= titanic_df['SibSp'] + titanic_df['Parch'] +1

In [15]:
titanic_df['FamilySize']

0      2
1      2
2      1
3      2
4      1
      ..
886    1
887    1
888    4
889    1
890    1
Name: FamilySize, Length: 891, dtype: int64

## passengers who were alone (FamilySize == 1).

In [22]:
titanic_df[titanic_df['FamilySize'] ==1] [['Name','FamilySize']]

                             Name  FamilySize
2          Heikkinen, Miss. Laina           1
4        Allen, Mr. William Henry           1
5                Moran, Mr. James           1
6         McCarthy, Mr. Timothy J           1
11       Bonnell, Miss. Elizabeth           1
..                            ...         ...
884        Sutehall, Mr. Henry Jr           1
886         Montvila, Rev. Juozas           1
887  Graham, Miss. Margaret Edith           1
889         Behr, Mr. Karl Howell           1
890           Dooley, Mr. Patrick           1

[537 rows x 2 columns]

## children (age < 12) survived vs. not survived?

In [24]:
titanic_df[titanic_df['Age'] <12].value_counts('Survived')

Survived
1    39
0    29
Name: count, dtype: int64

## the top 5 most common passenger names?

In [25]:
titanic_df['Name'].value_counts().head(5)

Name
Braund, Mr. Owen Harris                                1
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    1
Heikkinen, Miss. Laina                                 1
Futrelle, Mrs. Jacques Heath (Lily May Peel)           1
Allen, Mr. William Henry                               1
Name: count, dtype: int64

## Replace all missing ages with the median age.

In [26]:
median_age = titanic_df['Age'].median()

In [31]:
titanic_df['Age'].fillna(median_age)

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    28.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

## Fill missing Embarked values with the most common port.

In [33]:
titanic_df['Embarked'].value_counts().head(4)

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [35]:
titanic_df['Embarked'].isna().sum()

np.int64(2)

In [42]:
titanic_df['Embarked'] = titanic_df['Embarked'].fillna('S')

In [43]:
titanic_df['Embarked'].value_counts().head(4)

Embarked
S    646
C    168
Q     77
Name: count, dtype: int64

## Create a new column FareCategory:

In [45]:
def categorize_fare(fare):
    if fare < 10:
        return 'low'
    elif fare <= 30:
        return 'medium'
    else:
        return 'High'

In [47]:
titanic_df['FareCategory'] = titanic_df['Fare'].apply(categorize_fare)

In [49]:
titanic_df['FareCategory']

0         low
1        High
2         low
3        High
4         low
        ...
886    medium
887    medium
888    medium
889    medium
890       low
Name: FareCategory, Length: 891, dtype: object

## by using pd.cut

In [51]:


bins = [0, 10, 30, float('inf')]
labels = ['Low', 'Medium', 'High']

titanic_df['FareCategory'] = pd.cut(titanic_df['Fare'], bins=bins, labels=labels, right=False)

In [52]:
titanic_df['FareCategory']

0         Low
1        High
2         Low
3        High
4         Low
        ...
886    Medium
887      High
888    Medium
889      High
890       Low
Name: FareCategory, Length: 891, dtype: category
Categories (3, object): ['Low' < 'Medium' < 'High']

## youngest and oldest passenger for each class (Pclass).

In [53]:
#youngest
titanic_df.groupby('Pclass')['Age'].min()

Pclass
1    0.92
2    0.67
3    0.42
Name: Age, dtype: float64

In [54]:
#oldest
titanic_df.groupby('Pclass')['Age'].max()

Pclass
1    80.0
2    70.0
3    74.0
Name: Age, dtype: float64

## survival rate by gender and class.

In [58]:
titanic_df.groupby(['Sex', 'Pclass'])['Survived'].mean().unstack()

Pclass         1         2         3
Sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

## List all female passengers in First Class who survived.

In [65]:
titanic_df[(titanic_df['Sex']== 'female' ) & (titanic_df['Pclass']==1) &(titanic_df['Survived']==1)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize,FareCategory
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,High
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2,High
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S,1,Medium
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,28.0,1,0,PC 17569,146.5208,B78,C,2,High
52,53,1,1,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49.0,1,0,PC 17572,76.7292,D33,C,2,High
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
856,857,1,1,"Wick, Mrs. George Dennick (Mary Hitchcock)",female,45.0,1,1,36928,164.8667,NaN,S,3,High
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,25.9292,D17,S,1,Medium
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S,3,High
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C,2,High
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1,High

## Add a new column IsMinor (True if age < 18).

In [66]:
titanic_df['IsMinor']= titanic_df['Age'] < 18

In [67]:
titanic_df['IsMinor']

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: IsMinor, Length: 891, dtype: bool

In [68]:
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize,FareCategory,IsMinor
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2,Low,False
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,High,False
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,Low,False

## Create a new column extracting the title from each name (e.g., Mr., Mrs., Miss).

In [72]:
titanic_df['Title'] = titanic_df['Name'].str.extract(r' ([A-Za-z]+)\.', expand=False)

## survival rate for each title?

In [74]:
titanic_df.groupby('Title')['Survived'].mean()

Title
Capt        0.000000
Col         0.500000
Countess    1.000000
Don         0.000000
Dr          0.428571
Jonkheer    0.000000
Lady        1.000000
Major       0.500000
Master      0.575000
Miss        0.697802
Mlle        1.000000
Mme         1.000000
Mr          0.156673
Mrs         0.792000
Ms          1.000000
Rev         0.000000
Sir         1.000000
Name: Survived, dtype: float64

In [ ]:
titles= titanic-df.str.split(',')
titanic-df['Titles'] =

In [22]:
# def get_titles(name):
#     return name.split(',')[1].split('.')[0].strip()

In [27]:
def get_titles(name):
    # Split by comma, then by period
    try:
        return name.split(',')[1].split('.')[0].strip()
    except IndexError:
        return "Unknown"

In [28]:
titanic_df['titles']= titanic_df.Name.apply(get_titles)

In [29]:
titanic_df['titles']

0        Mr
1       Mrs
2      Miss
3       Mrs
4        Mr
       ...
886     Rev
887    Miss
888    Miss
889      Mr
890      Mr
Name: titles, Length: 891, dtype: object

In [30]:
## cleaning dupliates

In [31]:
titanic_df[titanic_df.duplicated(subset='Ticket')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,titles
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.0,3,1,349909,21.0750,NaN,S,Miss
71,72,0,3,"Goodwin, Miss. Lillian Amy",female,16.0,5,2,CA 2144,46.9000,NaN,S,Miss
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S,Miss
117,118,0,2,"Turpin, Mr. William John Robert",male,29.0,1,0,11668,21.0000,NaN,S,Mr
119,120,0,3,"Andersson, Miss. Ellis Anna Maria",female,2.0,4,2,347082,31.2750,NaN,S,Miss
...,...,...,...,...,...,...,...,...,...,...,...,...,...
876,877,0,3,"Gustafsson, Mr. Alfred Ossian",male,20.0,0,0,7534,9.8458,NaN,S,Mr
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C,Mrs
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S,Mrs
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q,Mrs
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,Miss

In [32]:
titanic_df.drop_duplicates(inplace= True)

In [33]:
titanic_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,titles
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,Rev
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,Miss
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,Miss
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,Mr
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,Mr

## Data management

In [35]:
titanic_df['Pclass'].astype('int64')

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: int64

In [38]:

titanic_df.astype(
    {'Survived':bool, 'Fare':int}
)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,titles
0,1,False,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7,NaN,S,Mr
1,2,True,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71,C85,C,Mrs
2,3,True,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7,NaN,S,Miss
3,4,True,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53,C123,S,Mrs
4,5,False,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8,NaN,S,Mr
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,False,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13,NaN,S,Rev
887,888,True,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30,B42,S,Miss
888,889,False,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23,NaN,S,Miss
889,890,True,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30,C148,C,Mr
890,891,False,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7,NaN,Q,Mr

In [39]:

titanic_df['Pclass'].astype('int8')

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: int8

## Indexing

In [40]:
titanic_df.index

RangeIndex(start=0, stop=891, step=1)

In [41]:
titanic_df.index =titanic_df.PassengerId

In [42]:
titanic_df.index

Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
       ...
       882, 883, 884, 885, 886, 887, 888, 889, 890, 891],
      dtype='int64', name='PassengerId', length=891)

In [46]:
titanic_df.set_index("PassengerId")

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,titles
PassengerId,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr
...,...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,Rev
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,Miss
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,Miss
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,Mr
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,Mr

In [49]:
titanic_df.reset_index(drop = True)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,titles
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,Rev
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,Miss
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,Miss
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,Mr
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,Mr